Repository: autohotkey-docs-translation/v1-fr
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: " 5 + MyVar2
fr: " 5 + MaVar2

source: "What is indentation?" you ask?
fr: "Qu'est-ce que l'indentation ?"

source: "AutoHotkey Help",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0
fr: "Aide pour AutoHotkey",,,"docs\AutoHotkey.htm","docs\AutoHotkey.htm",,,,,0x73500,,0x10200e,[200,0,1080,700],,,,,3,,0

source: "Command" may also refer to a specific predefined action, such as MsgBox.
fr: "Commande" peut aussi désigner une action prédéfinie spécifique, comme MsgBox.

source: "Delicious", "Price":
fr: "Délicieux", "Prix":

source: "If at first you don't succeed, try, try, try again." - Hickson, William E.
fr: "If at first you don't succeed, try, try, try again." (Si tu n'y arrives pas du premier coup, essaie, essaie, essaie encore) - Hickson, William E.

source: "Yellow", "Taste":
fr: "Jaune", "Gout":

source: #IfWinActive Untitled - Notepad
fr: #IfWinActive Sans titre - Bloc-notes

source: #IfWinActive Untitled - Paint
fr: #IfWinActive Sans titre - Paint

source: #Include LibDir\
fr: #Include DossierBibli\

source: #Include can be safely used within the auto-execute section to include files which contain only function definitions, since function definitions (but not function calls) are skipped over during execution.
fr: #Include peut être utilisé sans risque dans la section d'auto-exécution pour inclure des fichiers qui ne contiennent que des définitions de fonction, puisque les définitions de fonction (mais pas les appels de fonction) sont ignorées pendant l'exécution.

source: #Include generally should not be used in the middle of a subroutine or function.
fr: #Include ne devrait en général pas être utilisé au milieu d'un sous-programme ou d'une fonction.

source: #IncludeAgain LibDir\LibFile.ahk
fr: #IncludeAgain DossierBibli\FichierBibli.ahk

source: %AssociatedVar%
fr: %VarAssociee%

source: %WALeft% -- Top:
fr: %WALeft% -- Haut :

source: %WARight% -- Bottom:
fr: %WARight% -- Bas :

source: %WATop% -- Right:
fr: %WATop% -- Droite :

source: (A statement is simply the smallest standalone element of the language that expresses some action to be carried out.) The exception to this is line continuation (see below).
fr: (une instruction (statement) est simplement le plus petit élément du langage qui isolé exprime une action à réaliser.) L'exception à ceci est la continuation de ligne (voir ci-dessous).

source: (For the full list of symbols, see the Hotkey page)
fr: (Pour la liste complète des symboles, voir la page Hotkey)

source: ), C:\File.txt
fr: ), C:\Fichier.txt

source: ), C:\My File.txt
fr: ), C:\Mon Fichier.txt

source: */ this does not end the comment.
fr: */ ceci ne termine pas le commentaire.

source: , %A_ProgramFiles%\SomeApplication\LogFile.txt
fr: , %A_ProgramFiles%\UneApplication\FichierJournal.txt

source: ../static/ctrl_edit.png
fr: ../static/ctrl_edit_fr.png

source: ../static/ctrl_text.png
fr: ../static/ctrl_text_fr.png

source: /* and */ symbols can be used to comment out an entire section, but only if the symbols appear at the beginning of a line (excluding whitespace), as in this example:
fr: /* et */ peuvent être utilisés pour commenter toute une section, mais seulement si les symboles apparaissent au début d'une ligne (sauf espacement), comme dans cet exemple :

source: /f or /force
fr: /f ou /force

source: /iLib "OutFile"
fr: /iLib "FichierSortie"

source: /r or /restart
fr: /r ou /restart

source: 0x409 English (United States)
fr: 0x40c French (France)

source: 1 - The Basics
fr: 1 - Les Bases

source: 3 - Sending Keystrokes
fr: 3 - Envoyer des Frappes

source: 4 - Running Programs & Websites
fr: 4 - Lancer Programmes & Sites Web

source: 4th mouse button.
fr: 4ème bouton de la souris.

source: 5 - Commands vs. Functions()
fr: 5 - Commandes vs. Fonctions()

source: 5th mouse button.
fr: 5ème bouton de la souris.

source: 7 - Objects
fr: 7 - Objets

source: 8 - Other Helpful Goodies
fr: 8 - Autres Notions Utiles

source: ::msg::You typed msg in MSPaint!
fr: ::msg::Vous avez tapé msg dans MSPaint !

source: ::msg::You typed msg in Notepad
fr: ::msg::Vous avez tapé msg dans Notepad

source: ; lParam = the port which the debugger client is listening on.
fr: ; lParam = le port sur lequel le client débogueur écoute.

source: ; reset to the default of the current build. Modify as necessary:
fr: ; commentées pour revenir au codepage par défaut de la construction ; actuelle. Modifier selon le besoin :

source: ; wParam = the IPv4 address of the debugger client, as a 32-bit integer.
fr: ; wParam = l'adresse IPv4 du client débogueur, comme entier 32-bit.

source: ; A comment is allowed here.
fr: ; Un commentaire est autorisé ici.

source: ; Add more text to the variable via another continuation section.
fr: ; Ajouter plus de texte à la variable via une autre section de continuation.

source: ; Add the value of a variable to another (expression).
fr: ; Ajoute la valeur d'une variable à une autre (expression).

source: ; Allows a script's hidden main window to be detected.
fr: ; Permet de détecter la fenêtre principale cachée d'un script.

source: ; Any window that isn't Untitled - Notepad
fr: ; Toute fenêtre qui n'est pas Sans titre - Bloc-notes

source: ; Append a variable to the end of another (expression).
fr: ; Concatène une variable à la suite d'une autre (expression).

source: ; Assign a number to a variable (expression).
fr: ; Affecte un nombre à une variable (expression).

source: ; Assign a variable to another (expression).
fr: ; Affecte une variable à une autre (expression).

source: ; Assign a variable to another (legacy).
fr: ; Affecte une variable à une autre (dépassé).

source: ; Assign some text to a variable (legacy).
fr: ; Affecte du texte à une variable (dépassé).

source: ; Assigns a variable to another with some extra text (expression).
fr: ; Affecte une variable à une autre avec du texte en plus (expression).

source: ; Assigns a variable to another with some extra text (legacy).
fr: ; Affecte une variable à une autre avec du texte en plus (dépassé).

source: ; Assigns the literal text "A + B"
fr: ; Affecte le texte littéral "A + B"

source: ; Avoids the need to specify the full path of the file below.
fr: ; Evite d'avoir à indiquer le chemin complet du fichier ci-dessous.

source: ; Both of these send CTRL+S
fr: ; Ces deux commandes envoient CTRL+S

source: ; Break out of this loop.
fr: ; Rompre l'exécution de la boucle.

source: ; But leave the rest below unchanged.
fr: ; Mais ne pas modifier ce qui suit.

source: ; CTRL+B hotkey
fr: ; hotkey CTRL+B

source: ; CTRL+N hotkey
fr: ; hotkey CTRL+N

source: ; Comment.
fr: ; Commentaire.

source: ; Copies the selected text. ^c could be used as well, but this method is more secure.
fr: ; Copie le texte sélectionné. ^c pourrait aussi être utilisé, mais cette méthode est plus sûre.

source: ; Disable Alt+key shortcuts for the IME.
fr: ; Désactiver les raccourcis Alt+key pour le IME.

source: ; Double-deref in an expression => 42
fr: ; Double-déréf dans une expression => 42

source: ; EXAMPLE #1:
fr: ; EXEMPLE #1 :

source: ; EXAMPLE #2:
fr: ; EXEMPLE #2 :

source: ; End this thread so that the one underneath will resume and see the change made by the line above.
fr: ; Terminer ce thread afin que celui en dessous reprenne et voit les changements apportés par la ligne ci-dessus.

source: ; Fetch the contents of the variable whose name is contained in A_Index.
fr: ; Récupérer le contenu de la variable dont le nom est contenu dans A_Index.

source: ; For each parameter (or file dropped onto a script):
fr: ; Pour chaque paramètre (ou fichier déposé sur un script):

source: ; For each parameter:
fr: ; Pour chaque paramètre :

source: ; If No, stop the code from going further.
fr: ; Si c'est non (No), empêcher le code d'aller plus loin.

source: ; If one method doesn't work in your program, please try the other.
fr: ; Si une méthode ne fonctionne pas pour un programme, en essayer une autre.

source: ; Keep it down for one second.
fr: ; La maintenir appuyée une seconde.

source: ; Normal (single) variable reference in an expression => target
fr: ; Référence normale (simple) de variable dans une expression => cible

source: ; Normal (single) variable reference in text => target
fr: ; Référence normale (simple) de variable dans du texte => cible

source: ; Notice the ! between the curly brackets? That's because if it wasn't, AHK would press the ALT key.
fr: ; Si le ! n'était pas entre accolades, AutoHotKey appuierait sur la touche Alt

source: ; Optional parameters:
fr: ; Paramètres facultatifs :

source: ; Otherwise, the user picked yes.
fr: ; Sinon, l'utilisateur a choisi oui.

source: ; Otherwise:
fr: ; Sinon :

source: ; Pause.
fr: ; Mettre en Pause.

source: ; Press Ctrl+Alt+P to pause. Press it again to resume.
fr: ; Appuyer sur Ctrl+Alt+P pour mettre en pause. Appuyer à nouveau pour reprendre.

source: ; Press down the up-arrow key.
fr: ; Appuyer sur la touche flèche vers le haut.

source: ; Prevents the status bar from showing a mouse-hover link instead of "Done".
fr: ; Empêche la barre de statut d'afficher un lien lié au survol de la souris au lieu de "Done".

source: ; Release the up-arrow key.
fr: ; Ne plus appuyer sur la touche flèche vers le haut.

source: ; Reload.
fr: ; Recharger.

source: ; Remap CapsLock to LCtrl in a way compatible with IME.
fr: ; Remappez VerrMaj à Ctrl (gauche) d'une façon compatible avec IME.

source: ; Replace 159 with the value discovered above. Replace FF (if needed) with the
fr: ; Remplace 159 avec la valeur découverte auparavant. Remplacez FF (si nécessaire) par le

source: ; Replace 159 with your key's value.
fr: ; Remplace 159 avec la valeur de votre touche.

source: ; Replace all spaces with pluses:
fr: ; Remplace les espaces par des plus :

source: ; Replaces "btw" with "by the way" as soon as you press an default ending character.
fr: ; Remplace "btw" par "by the way" dès qu'un caractère final par défaut est tapé.

source: ; Replaces "btw" with "by the way" without needing an ending character.
fr: ; Remplace "btw" par "by the way" sans attendre de caractère final.

source: ; Requires AutoHotkey v1.1.26+, and the keyboard hook must be installed.
fr: ; Requère AutoHotkey v1.1.26+, et le hook clavier doit être installé.

source: ; Reset in preparation for the next press of this hotkey.
fr: ; Remise à zéro en préparation de la prochaine activation de cette hotkey.

source: ; Run Notepad when you press CTRL+N.
fr: ; Lancer Notepad en faisant CTRL+N.

source: ; Run a program. Note that most programs will require a FULL file path:
fr: ; Lancer un programme. Pour la plupart des programmes, il faut utiliser un chemin COMPLET :

source: ; Run a website:
fr: ; Ouvrir un site web :

source: ; Run some websites:
fr: ; Ouvrir des sites web :

source: ; Run the "My Documents" folder using a built-in variable:
fr: ; Ouvrir le dossier "My Documents" en utilisant une variable intégrée :

source: ; SET THIS TO THE FULL PATH OF THE SCRIPT
fr: ; METTRE ICI LE CHEMIN COMPLET DU SCRIPT

source: ; Same as above, but with the ENTER key. AHK would type out "Enter" if
fr: ; Comme ci-dessus, mais avec la touche entrée. AutoHotkey écrirait "Enter" si

source: ; Save this for use in the second loop, below.
fr: ; Garder cette valeur pour utilisation dans la seconde boucle, ci-dessous.

source: ; See Send {vkXXscYYY} for more details.
fr: ; Veulliez voir Send {vkXXscYYY} pour plus de détailes.

source: ; Set for all users.
fr: ; Modifer pour tous les utilisateurs.

source: ; Set for current user only.
fr: ; Modifer pour l'utilisateur actuel seulement.

source: ; Several programs do not need a full path, such as Windows-standard programs:
fr: ; Plusieurs programmes n'ont pas besoin d'un chemin complet, comme les programmes standards de Windows :

source: ; Shows "%A_UserName%"
fr: ; Affiche "%A_UserName%"

source: ; Shows "1+1"
fr: ; Affiche "1+1"

source: ; Shows "2"
fr: ; Affiche "2"

source: ; Shows A, then B, then C.
fr: ; Affiche A, puis B, puis C.

source: ; Shows your username.
fr: ; Affiche le nom de l'utilisateur.

source: ; Signal that thread's loop to stop.
fr: ; Signaler à la boucle de ce thread d'arrêter.

source: ; Sleep for m milliseconds.
fr: ; Attendre m millisecondes.

source: ; Sleep for n seconds.
fr: ; Attendre n secondes.

source: ; Some examples showing when to use percents and when not:
fr: ; Quelques exemples de quand utiliser ou non les signes pourcentage :

source: ; Subtract the value of a variable from another (expression).
fr: ; Soustrait la valeur d'une variable à une autre (expression).

source: ; Suspend.
fr: ; Suspendre.

source: ; Test hotkey:
fr: ; Teste hotkey:

source: ; The comma is required in this case.
fr: ; La virgule est requise dans ce cas.

source: ; The left side of a non-expression if-statement is always the name of a variable.
fr: ; Le côté gauche d'une instruction if non-expression est toujours le nom d'une variable.

source: ; The next four lines are the action you want to repeat (update them to suit your preferences):
fr: ; Les quatre prochaines lignes sont l'action à répéter (les modifier selon ce qui doit être accompli):

source: ; The user signaled the loop to stop by pressing Win-Z again.
fr: ; L'utilisateur a indiqué à la boucle de s'arrêter en appuyant encore sur Win-Z.

source: ; These are commands:
fr: ; Il y a des commandes :

source: ; These are functions:
fr: ; Et voici des fonctions :

source: ; This banana has been pickled. Eww.
fr: ; Cette banane est au vinaigre. Beurk.

source: ; This ends the hotkey. The code below this point will not get triggered.
fr: ; Termine la hotkey. Le code en-dessous ne sera pas activé.

source: ; This ends the hotkey. The code below this will not get triggered.
fr: ; Termine la hotkey. Le code en-dessous ne sera pas activé.

source: ; This entire line is a comment.
fr: ; Cette ligne entière est un commentaire.

source: ; This is a comment on the same line as a command.
fr: ; Ceci est un commentaire sur la même ligne qu'une commande.

source: ; This is how you hold one key down and press another key (or keys).
fr: ; Voici comment maintenir une touche puis appuyer sur une ou plusieurs touches.

source: ; This means an underlying thread is already running the loop below.
fr: ; Ceci veut dire qu'un thread (fil d'exécution) exéute déjà la boucle ci-dessous.

source: ; Uncomment the appropriate line below or leave them all commented to
fr: ; Décommenter la ligne appropriée ci-dessous ou les laisser toutes

source: ; Untitled - Notepad
fr: ; Sans titre - Bloc-notes

source: ; Update this to reflect the script's name (case sensitive).
fr: ; Changer ceci pour refléter le nom du script (sensible à la casse).

source: ; Variable inside a command that uses InputVar and OutputVar.
fr: ; Une variable dans une commande qui utilise VarEntree et VarSortie.

source: ; Variable inside a command.
fr: ; Une variable dans une commande.

source: ; Variable inside a function. This is always an expression.
fr: ; Une variable dans une fonction. C'est toujours une expression.

source: ; WRONG
fr: ; INCORRECT

source: ; We don't have any red products, so don't bother calling the function.
fr: ; Pas de produit rouge disponible, pas besoin d'appeler la fonction.

source: ; When making a hotkey...
fr: ; Pour une hotkey...

source: ; Whenever an IF has parentheses, it'll be an expression. So no percent signs.
fr: ; Quand un IF (si) a des parenthèses, c'est une expression. Donc pas de signes pourcentage.

source: ; Win+Spacebar
fr: ; Win+Espace

source: ; Win+Z hotkey (change this hotkey to suit your preferences).
fr: ; hotkey Win+Z (changer selon préférences).

source: ; Without parentheses, the IF is legacy. However, only variables on the 'right side' need percent signs.
fr: ; Sans parenthèses, le IF (si) est dépassé. Toutefois, seules les variables du 'côté droit' ont besoin des signes pourcentage.

source: ; Wraps the selected text in BBCode tags to make it bold in a forum.
fr: ; Met le texte sélectionné entre tags BBCode pour l'afficher en gras sur un forum.

source: ; Wrong
fr: ; Incorrect

source: ; codepage := 0 ; System default ANSI codepage
fr: ; codepage := 0 ; Codepage par défaut du système ANSI

source: ; codepage := 1252 ; ANSI Latin 1; Western European (Windows)
fr: ; codepage := 1252 ; ANSI Latin 1; Europe de l'Ouest (Windows)

source: ; it wasn't wrapped in curly brackets.
fr: ; les accolades n'étaient pas présentes.

source: ; key's virtual key, which can be discovered in the first column of the Key History screen.
fr: ; la touche virtuel de la touche, ce qui peut être découverte la première colonne dans l'écran Key History (l'Historique des touches).

source: ; or
fr: ; ou

source: ; try various milliseconds
fr: ; essayer différents nombres de millisecondes

source: ; {} also works in place of {1}.
fr: ; {} fonctionne aussi à la place de {1}.

source: Assign after comma:
fr: Affectation après une virgule :

source: Auto-concat with ( is more selective, so some invalid expressions like 12(34) no longer work.
fr: Auto-concat avec ( est plus sélectif, donc certaines expressions invalides comme 12(34) ne fonctionnent plus.

source: Break exits (terminates) a loop, effectively jumping to the next line after the loop's body.
fr: Break sort d'une boucle, la termine, c'est-à-dire saute à la ligne suivant le corps de la boucle.

source: Break exits (terminates) a loop.
fr: Break (casser) sort d'une boucle, la termine.

source: ByRef indicates that the parameter accepts a variable reference, making that parameter an alias for whichever variable the caller passes.
fr: ByRef indique que le paramètre accepte une référence de variable, faisant de ce paramètre un alias de la variable quelconque passée par l'appelant.

source: Case-insensitive equal:
fr: Egalité insensible à la casse :

source: Catch executes its body after an exception is thrown within a try statement (and only if an exception is thrown).
fr: Catch (attraper) exécute son corps après qu'une exception ait été lancée dans une instruction try (et seuelment si une exception a été lancée).

source: Code blocks are lines of code surrounded by little curly brackets ({ and }).
fr: Les blocs de code sont des lignes de codes entre accolades ({ et }).

source: Commands accept a mixture of unquoted text, variable names and numeric expressions.
fr: Les commandes acceptent un mix de texte sans guillemets, de noms de variables et d'expressions numériques.

source: Commands are designed to take a list of parameters and perform only a single action per line, whereas simple expressions can be pieced together to form increasingly more complex expressions.
fr: Les commandes sont conçues pour prendre une liste de paramètres et réaliser une unique action par ligne, tandis que des expressions simples peuvent être rassemblées pour former des expressions de plus en plus complexes.

source: Concepts and Conventions:
fr: Concepts et Conventions :

source: Concepts and conventions:
fr: Concepts et conventions :

source: Continuation sections, where multiple lines are merged with the line above the section.
fr: Les sections de continuation, où plusieurs lignes sont fusionnées avec la ligne précédant la section.

source: Continue skips the rest of the current loop iteration and begins a new one.
fr: Continue (continuer) saute le reste de l'itération en cours de la boucle et passe à l'itération suivante.

source: Convert a Script to an EXE (ahk2exe):
fr: Convertir un Script en EXE (ahk2exe) :

source: Debugging a Script:
fr: Déboguer un Script :

source: Declare and initialize:
fr: Déclarer et initialiser :

source: Else, Try and Finally allow any valid statement to their right, as they require a body but have no parameters.
fr: Else, Try et Finally autorisent n'importe quelle instruction valide à leur droite, puisqu'elles nécessitent un corps mais n'ont pas de paramètre.

source: Escape sequences such as `n (linefeed) and `t (tab) are supported inside the continuation section except when the accent (`) option has been specified.
fr: Les séquences d'échappement comme `n (saut de ligne) et `t (tabulation) sont pris en charge à l'intérieur de la section de continuation sauf quand l'option accent grave (`) a été spécifiée.

source: Escaped percent signs (`%) and percent signs in quoted literal strings have no special meaning (they are interpreted as literal percent signs).
fr: Les signes pourcentage échappés (`%) et ceux dans les chaînes de caractères littérales entre guillemets n'ont pas de sens particulier (ils sont interprétés littéralement comme des signes pourcentage).

source: FileEncoding controls the default encoding of files read or written by the script, while IniRead and IniWrite always deal in UTF-16 or ANSI.
fr: FileEncoding contrôle l'encodage par défaut des fichiers lus ou écrits par le script, tandis que IniRead et IniWrite utilisent toujours UTF-16 ou ANSI.

source: FileOpen and File.Read
fr: FileOpen et File.Read

source: FileOpen and File.Write
fr: FileOpen et File.Write

source: FileRead translates text between code pages in certain common cases and therefore might output corrupt binary data.
fr: FileRead traduit du texte entre les pages de code dans certains cas courants et peut donc générer des données binaires corrompues.

source: Finally executes its body when control is being transferred out of a try or catch statement's body.
fr: Finally (enfin) exécute son corps quand le contrôle est transféré hors du corps d'une instruction try ou catch.

source: For and several types of If statement use keywords or an operator instead of commas to separate some of their parameters.
fr: For et plusieurs type d'instruction If utilisent des mot-clés ou un opérateur au lieu de virgules pour séparer certains de leurs paramètres.

source: For executes a statement once for each value or pair of values returned by an enumerator, such as each key-value pair in an object.
fr: For exécute une instruction une fois par valeur ou paire de valeurs renvoyée par un énumérateur, comme chaque paire clé-valeur d'un objet.

source: For, While, Until and Throw always accept expressions.
fr: For, While, Until et Throw acceptent toujours des expressions.

source: Function and method calls require there to be no space between the function/method name and (.
fr: Les appels à une fonction ou à une méthode nécessitent de ne pas mettre un espace entre le nom de la fonction/méthode et (.

source: GetKeyState (the function returns 0 or 1, not "U" or "D")
fr: GetKeyState (la fonction renvoie 0 ou 1, et pas "U" ou "D")

source: Gosub calls a subroutine.
fr: Gosub appelle un sous-programme (subroutine).

source: Goto jumps to the specified label and continues execution.
fr: Goto (aller à) saute au label (étiquette) spécifié et continue l'exécution.

source: If (expression) and While allow an open parenthesis to be used immediately after the name.
fr: If (expression) et While autorisent une parenthèse ouvrante à être utilisée immédiatement après le nom.

source: If (expression) evaluates an expression and executes the following statement only if the result is true.
fr: If (expression) évalue une expression et exécute l'instruction suivante seulement si le résultat est vrai.

source: If Var op Value, where op is one of the following operators:
fr: If Var op Valeur, où op est l'un des opérateurs suivants :

source: If statements perform an action only if the specified condition is met.
fr: Les instructions If effectuent une action seulement si la condition spécifiée est vérifiée.

source: In section 5 we'll talk about why it doesn't work as you might expect and what you can do instead.
fr: Dans la section 5 seront abordées les raisons pour lesquelles cela ne fonctionne pas comme prévu et ce qui peut être fait à la place.
